nxp-mcuxpresso/mcux-sdk-examples/frdmke17z/demo_apps/power_manager/pin_mux.h
/*
 * Copyright 2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTB0 (number 54), UART0_RX_TGTMCU
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_UART0_RX_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_UART0_RX_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_UART0_RX_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTB1 (number 53), UART0_TX_TGTMCU
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_UART0_TX_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_UART0_TX_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_UART0_TX_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTE14 (number 17), SW3/BUTTON_1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SW3_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_SW3_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW3_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SW3_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_SW3_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_SW3_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
